Repository: vs-machado/ChurchApp
Catalog: lib/l10n/intl_*.arb
Languages: pt

source: Home page
pt: Página inicial

source: Welcome!
pt: Bem-vindo!

source: Posts loaded.
pt: Posts carregados.

# anErrorOccurred
source: An error occurred. Try again.
pt: Ocorreu um erro. Tente novamente.

source: Registration
pt: Cadastro

source: Password
pt: Senha

source: Confirm password
pt: Confirmar senha

source: Register
pt: Cadastrar

# insertAValidEmail
source: Enter a valid email.
pt: Insira um email válido.

# passwordRequiresLettersAndNumbers
source: Password must have at least 8 characters and contain letters and numbers.
pt: A senha deve possuir no mínimo 8 caracteres e conter letras e números.

# doesnHaveAnAccountRegister
source: Don't have an account? Register
pt: Não possui uma conta? Cadastre-se

# noInternetConnection
source: No internet connection. Please check your network and try again.
pt: Erro: sem conexão com a internet.

# somethingWentWrong
source: Something went wrong. Please try again.
pt: Algo deu errado. Tente novamente mais tarde.

# passwordsAreNotTheSame
source: Passwords do not match. Please try again.
pt: As senhas inseridas não são iguais. Tente novamente.

# registerFailed
source: Registration failed. Please try again.
pt: Falha no cadastro. Tente novamente mais tarde.

# requestTimeout
source: The request timed out. Please try again.
pt: A conexão expirou. Por favor, tente novamente.

# tooManyRequests
source: Too many requests. Please wait a moment and try again.
pt: Demasiados pedidos. Por favor, aguarde um momento e tente novamente.

# serverError
source: A server error occurred. Please try again later.
pt: Ocorreu um erro no servidor. Por favor, tente novamente mais tarde.

# incorrectPassword
source: Incorrect email or password. Please check your credentials and try again.
pt: Email ou senha incorretos. Corrija e tente novamente.

# emailAlreadyInUse
source: Error: This email has already been registered.
pt: Erro: Este email já foi cadastrado anteriormente.

# welcomeTo
source: Welcome to Reino Church!
pt: Bem vindo ao Reino Church!

# signInGoogleAccount
source: Sign in with Google account
pt: Entrar com conta Google

# registerEmailPassword
source: Register with email and password
pt: Registrar com email e senha

source: Enter
pt: Entrar

source: Create your account
pt: Crie sua conta

source: or
pt: ou

# haveAnAccount
source: Already have an account?
pt: Possui uma conta?
